tap "homebrew/bundle"

brew "python"
brew "uv" # pyython package manager


brew "git"
brew "zsh"
brew "autojump"
brew "thefuck"
brew "yqrashawn/goku/goku"
brew "jq"
brew "zsh-syntax-highlighting"
brew "terraform"
brew  "minikube"
brew "jesseduffield/lazygit/lazygit"
brew "gpg"

#Javascript/react
brew "node"
brew "yarn"
brew "watchman"
brew "pnpm"
brew "deno"

#Flutter/Firebase/Dart
brew "firebase-cli"

# cask "flutter"
# cask "warp"

brew "rust"

cask "karabiner-elements"
cask "rectangle"
cask "shottr"
cask "google-chrome"
cask "messenger"
cask "slack"
cask "warp"
cask "Alfred"
cask "docker"
cask "arc"
cask "keyboard-maestro"


cask "cursor"
cask "obsidian"
cask "microsoft-teams"
cask "microsoft-outlook"
cask "keeper-password-manager"