tap "homebrew/bundle"

brew "python"
brew "uv" # pyython package manager


brew "git"
brew "zsh"
brew "autojump"
brew "thefuck"
brew "pyenv"  # Python Version Management
brew "pipenv" # Python Dependency Management
brew "neovim"
brew "yqrashawn/goku/goku"
brew "jq"
brew "zsh-syntax-highlighting"
brew "the_silver_searcher" # Code-search tool (like ack, but faster)
brew "terraform"
brew  "kubectl"
brew  "minikube"
brew "jesseduffield/lazygit/lazygit"

#Javascript/react
brew "node"
brew "yarn"
brew "watchman"
brew "pnpm"
brew "deno"

#Flutter/Firebase/Dart
brew "firebase-cli"

# cask "flutter"
# cask "warp"

brew "rust"

cask "karabiner-elements"
cask "rectangle"
cask "shottr"
cask "google-chrome"
cask "messenger"
cask "slack"
cask "mindmac"
cask "zed"
cask "docker"
cask "cursor"
