tap "homebrew/bundle"

brew "python"
brew "uv" # python package manager


brew "git"
brew "zsh"
brew "jq"
brew "terraform"
brew  "minikube"
brew "jesseduffield/lazygit/lazygit"
brew "gpg"
brew "ollama"

# Terminal feel: prompt + modern CLI tools
brew "starship"  # prompt (replaces OMZ theme, config in starship.toml)
brew "zoxide"    # smarter cd (replaces autojump, which is unmaintained)
brew "fzf"       # fuzzy finder: Ctrl+R history, Ctrl+T files, fzf-tab completion
brew "eza"       # modern ls with colors, icons, git status
brew "bat"       # cat with syntax highlighting
brew "fd"        # modern find (also backs fzf file search)
brew "ripgrep"   # modern grep

brew "yqrashawn/goku/goku"

#Javascript/react
brew "node"
brew "yarn"
brew "watchman"
brew "pnpm"
brew "deno"

#Flutter/Firebase/Dart
brew "firebase-cli"

# cask "flutter"
# cask "warp"

brew "rust"

cask "karabiner-elements"
cask "rectangle"
cask "shottr"
cask "slack"
cask "Alfred"
cask "docker"
cask "helium-browser"
cask "keyboard-maestro"
cask "hammerspoon"
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"  # Nerd Font for prompt/eza icons


cask "cursor"
cask "obsidian"
cask "keeper-password-manager"
